//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"BUILDING_ENTITY_STORE"="Provedení kroku %d z %d: Vytváření schránky entit";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"CREATING_BOOTSTRAP_DATABASE"="Provedení kroku %d z %d:  Vytváření samozaváděcí databáze";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"CREATING_REQUEST_QUEUE_DATABASE"="Provedení kroku %d z %d:  Vytváření databáze front požadavků";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - received bytes; 2nd %s - total bytes.
"DOWNLOADING_ENTITY_STORE"="Provedení kroku %d z %d: Stahování schránky entit. Dosud přijato %s z %s.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"ERASING_EXPIRED_REQUESTS"="Provedení kroku %d z %d: Výmaz expirovaných požadavků";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"LOADING_METADATA"="Provedení kroku %d z %d: Zavádění metadat";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"PERFORMING_REQUEST_QUEUE_MERGE"="Provedení kroku %d z %d: Provádění sloučení front požadavků";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"PERFORMING_TRANSACTION_MERGE"="Provedení kroku %d z %d: Provádění sloučení transakcí";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"PERFORMING_CREATE_DELETE_MERGE"="Provedení kroku %d z %d: Provádění vytvoření, odstranění, sloučení";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - request name; 2nd %s - request url.
"PROCESSING_DEFINING_QUERIES"="Provedení kroku %d z %d: Zpracování definujících dotazů %s pomocí %s";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - request number; 2nd %s - total request number.
"PROCESSING_REQUESTS"="Provedení kroku %d z %d: Zpracování požadavků. Odeslání požadavku modifikace %s z %s.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"REAPPLYING_CHANGES"="Provedení kroku %d z %d: Znovupoužití změn";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"ANALYZING_RECEIVED_DATA"="Provedení kroku %d z %d: Analýza přijatých dat";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. %s - received bytes.
"RECEIVING_DATA_FROM_SERVER"="Provedení kroku %d z %d: Příjem dat ze serveru. Dosud přijato %s.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"REMOVING_DELETED_RELATIONSHIPS"="Provedení kroku %d z %d: Odebrání odstraněných vztahů";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. Removing requests that have a custom http header "REMOVE_AFTER_UPLOAD". Note: the header name is a constant, please do not translate.
"REMOVING_REMOVEAFTERUPLOAD_REQUESTS"="Provedení kroku %d z %d: Odebrání požadavků specifikovaných jako RemoveAfterUpload";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. %s - sent bytes.
"SENDING_DATA_TO_SERVER"="Provedení kroku %d z %d: Odeslání dat na server. Dosud odesláno %s.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - sent bytes; 2nd %s - total bytes.
"SENDING_ENTITY_STORE_DATABASE"="Provedení kroku %d z %d: Odeslání databáze schránek entit. Dosud odesláno %s z %s.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps. 1st %s - sent bytes; 2nd %s - total bytes.
"SENDING_REQUEST_QUEUE_DATABASE"="Provedení kroku %d z %d: Odeslání databáze front požadavků. Dosud odesláno %s z %s.";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"STARTING_COMMUNICATION_WITH_SERVER"="Provedení kroku %d z %d: Zahájení komunikace se serverem";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"UPLOAD_PREPROCESSING"="Provedení kroku %d z %d: Předběžné zpracování požadavků před odesláním";

//XMSG: 1st %d - current step number; 2nd %d - total number of steps.
"WAITING_FOR_DOWNLOAD"="Provedení kroku %d z %d: Čekání na stažení";

